posts/2019-03-11-powershell-git-hooks/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Use PowerShell Scripts in Git Hooks</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Use PowerShell Scripts in Git Hooks</h1>
</header><p>
Adding a small git hook into a project is rather easy. The following hook calls
a PowerShell script which in turn runs a <a href="https://github.com/psake/psake">psake</a> task to search for linter issues.
The script (<code>.git/hooks/pre-push</code>) looks like this:
</p>

<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh

C:/Windows/System32/WindowsPowerShell/v1.0/powershell.exe -Command 'psake Invoke-Linter'
</pre>
</div>

<p>
<b>Warning:</b> Hooks should not contain carriage returns. Use <code>LF</code> instead of
<code>CRLF</code>.
</p>

<p>
And here's a tiny psake task which helps me to install git hooks:
</p>

<div class="org-src-container">
<pre class="src src-powershell">task Install-GitHooks {
    Get-ChildItem '.\my_hooks' | Copy-Item -Destination '.\.git\hooks' -Force
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-03-11</p>
<footer>
<p>Copyright 2024, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>